{
  "oops": {
    "polymorphism": "Polymorphism allows methods to do different things based on the object it is acting upon. It is achieved via method overloading and overriding.",
    "inheritance": "Inheritance allows a class (child) to acquire properties and behavior of another class (parent). It promotes code reuse.",
    "encapsulation": "Encapsulation is the bundling of data and methods that operate on that data within one unit, like a class. It hides internal state from outside.",
    "abstraction": "Abstraction hides unnecessary implementation details and shows only essential features. It’s implemented using abstract classes or interfaces.",
    "class and object": "A class is a blueprint, and an object is an instance of that class. Objects hold state and behavior defined by the class.",
    "constructor": "A constructor is a special method invoked when an object is created. It initializes object properties.",
    "destructor": "A destructor is called when an object is destroyed, used to release resources or perform clean-up.",
    "method overloading": "Method overloading allows multiple methods with the same name but different parameters in a class.",
    "method overriding": "Method overriding means redefining a method in a derived class that already exists in the base class.",
    "this keyword": "The `this` keyword refers to the current object. It's used to access members of the current class.",
    "interface vs abstract class": "An interface only defines method signatures without implementation. An abstract class can have both abstract and concrete methods. Interfaces support multiple inheritance; abstract classes do not.",
    "static keyword": "The `static` keyword makes a method or variable belong to the class instead of an instance. It can be accessed without creating an object.",
    "access specifiers": "Access specifiers like public, private, and protected control the visibility of class members.",
    "object slicing": "Object slicing occurs when an object of a derived class is assigned to a base class object, and derived-specific members are 'sliced off'."

  },
  "dbms": {
    "acid properties": "ACID stands for Atomicity, Consistency, Isolation, Durability — properties that ensure reliable transactions.",
    "normalization": "Normalization is the process of organizing data to reduce redundancy and improve data integrity using forms like 1NF, 2NF, 3NF.",
    "denormalization": "Denormalization is the process of introducing redundancy to improve performance by reducing joins.",
    "sql": "SQL (Structured Query Language) is used to manage and query relational databases.",
    "joins": "Joins combine rows from two or more tables based on a related column. Types include INNER JOIN, LEFT JOIN, RIGHT JOIN, and FULL JOIN.",
    "indexing": "Indexing improves the speed of data retrieval at the cost of extra storage and slower insertions.",
    "views": "A view is a virtual table based on the result-set of an SQL query. It simplifies complex queries.",
    "triggers": "A trigger is a procedural code that is automatically executed in response to certain events on a table.",
    "primary key": "A primary key uniquely identifies each record in a table. It cannot have NULLs and must be unique.",
    "foreign key": "A foreign key is a field in one table that refers to the primary key in another. It enforces referential integrity.",
    "transaction": "A transaction is a sequence of operations that are treated as a single logical unit of work. It must be ACID compliant.",
    "concurrency control": "Concurrency control ensures correct results for concurrent database transactions by managing simultaneous operations.",
    "2pl (Two-Phase Locking)": "2PL ensures serializability using two phases: growing (acquiring locks) and shrinking (releasing locks).",
    "er diagram": "ER Diagram is a visual representation of entities and their relationships used in database design.",
    "difference between delete and truncate": "`DELETE` removes rows based on a condition and can be rolled back. `TRUNCATE` removes all rows quickly and cannot be rolled back in some databases."
    },
  "os": {
    "process vs thread": "A process is an independent program in execution, while a thread is a lightweight unit within a process.",
    "scheduling algorithms": "These determine the execution order of processes. Examples: FCFS, SJF, Priority, Round Robin.",
    "deadlock": "A deadlock is a state where a set of processes is blocked because each is waiting for a resource held by the other.",
    "memory management": "OS handles memory allocation and deallocation using techniques like paging, segmentation, and virtual memory.",
    "paging": "Paging is a memory management technique where processes are divided into fixed-size pages and stored in frames.",
    "segmentation": "Segmentation divides memory into variable-sized segments based on logical divisions like functions or arrays.",
    "file system": "The file system manages how data is stored and retrieved. It organizes files into directories and manages permissions.",
    "system calls": "System calls are the interface between the OS and user programs to request OS services like I/O, memory, or file handling.",
    "interrupts": "Interrupts are signals to the processor indicating an event that needs immediate attention.",
    "virtual memory": "Virtual memory uses hardware and software to allow the execution of processes that may not be fully in physical memory.",
    "mutex vs semaphore": "A mutex allows only one thread to access a resource at a time. A semaphore is a counter used to manage access to multiple instances of a resource.",
    "context switching": "Context switching is the process of saving and loading the state of a CPU so that execution can resume from the same point later.",
    "thrashing": "Thrashing happens when the OS spends more time swapping pages in and out of memory than executing actual processes.",
    "multithreading": "Multithreading is the ability of a CPU to execute multiple threads concurrently, improving performance and resource utilization.",
    "kernel and user mode": "Kernel mode allows unrestricted access to system resources, while user mode has restricted access to ensure safety and security."
    },
  "cn": {
    "osi model": "The OSI model is a 7-layer conceptual framework used to standardize network functions from physical transmission to application support.",
    "tcp/ip model": "A 4-layer model used in real-world networking: Application, Transport, Internet, and Network Access.",
    "ip address": "An IP address is a unique identifier assigned to each device connected to a network using the Internet Protocol.",
    "subnetting": "Subnetting divides a network into smaller, efficient sub-networks, improving performance and security.",
    "dns": "Domain Name System translates human-readable domain names (like google.com) into IP addresses.",
    "mac address": "MAC address is a hardware address that uniquely identifies each device on a local network.",
    "switch vs router": "A switch connects devices in the same network; a router connects different networks and manages traffic between them.",
    "http vs https": "HTTPS is the secure version of HTTP, where data is encrypted using SSL/TLS for secure communication.",
    "firewall": "A firewall monitors and controls incoming and outgoing network traffic based on security rules.",
    "packet switching": "Packet switching breaks data into packets sent independently across the network. It's the basis of internet communication.",
    "udp vs tcp": "TCP is connection-oriented, reliable, and slower; UDP is connectionless, faster, but unreliable. TCP is used in HTTP, while UDP is used in streaming.",
    "congestion control": "Congestion control techniques (e.g., slow start, congestion avoidance) ensure efficient network utilization by preventing overload.",
    "ssl/tls": "SSL/TLS are cryptographic protocols that provide encrypted communication and authentication over a network.",
    "icmp": "ICMP is used for error reporting and diagnostics in networks, such as with the `ping` and `traceroute` tools.",
    "arp protocol": "Address Resolution Protocol (ARP) maps an IP address to a MAC address in a local network."
  }
}
